_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_33 (Conv2D)           (None, 48, 48, 64)        1664      
_________________________________________________________________
conv2d_34 (Conv2D)           (None, 48, 48, 64)        102464    
_________________________________________________________________
max_pooling2d_17 (MaxPooling (None, 24, 24, 64)        0         
_________________________________________________________________
dropout_25 (Dropout)         (None, 24, 24, 64)        0         
_________________________________________________________________
conv2d_35 (Conv2D)           (None, 24, 24, 64)        102464    
_________________________________________________________________
conv2d_36 (Conv2D)           (None, 24, 24, 64)        102464    
_________________________________________________________________
max_pooling2d_18 (MaxPooling (None, 12, 12, 64)        0         
_________________________________________________________________
dropout_26 (Dropout)         (None, 12, 12, 64)        0         
_________________________________________________________________
flatten_9 (Flatten)          (None, 9216)              0         
_________________________________________________________________
dense_25 (Dense)             (None, 512)               4719104   
_________________________________________________________________
dense_26 (Dense)             (None, 512)               262656    
_________________________________________________________________
dropout_27 (Dropout)         (None, 512)               0         
_________________________________________________________________
dense_27 (Dense)             (None, 7)                 3591      
=================================================================
Total params: 5,294,407
Trainable params: 5,294,407
Non-trainable params: 0
_________________________________________________________________