_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_9 (Conv2D)            (None, 48, 48, 64)        1664      
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 48, 48, 64)        102464    
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 24, 24, 64)        0         
_________________________________________________________________
dropout_7 (Dropout)          (None, 24, 24, 64)        0         
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 24, 24, 64)        102464    
_________________________________________________________________
conv2d_12 (Conv2D)           (None, 24, 24, 64)        102464    
_________________________________________________________________
max_pooling2d_6 (MaxPooling2 (None, 12, 12, 64)        0         
_________________________________________________________________
dropout_8 (Dropout)          (None, 12, 12, 64)        0         
_________________________________________________________________
flatten_3 (Flatten)          (None, 9216)              0         
_________________________________________________________________
dense_8 (Dense)              (None, 1024)              9438208   
_________________________________________________________________
dense_9 (Dense)              (None, 1024)              1049600   
_________________________________________________________________
dense_10 (Dense)             (None, 1024)              1049600   
_________________________________________________________________
dropout_9 (Dropout)          (None, 1024)              0         
_________________________________________________________________
dense_11 (Dense)             (None, 7)                 7175      
=================================================================
Total params: 11,853,639
Trainable params: 11,853,639
Non-trainable params: 0
_________________________________________________________________