_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_21 (Conv2D)           (None, 48, 48, 64)        1664      
_________________________________________________________________
conv2d_22 (Conv2D)           (None, 48, 48, 64)        102464    
_________________________________________________________________
max_pooling2d_11 (MaxPooling (None, 24, 24, 64)        0         
_________________________________________________________________
dropout_16 (Dropout)         (None, 24, 24, 64)        0         
_________________________________________________________________
conv2d_23 (Conv2D)           (None, 24, 24, 64)        102464    
_________________________________________________________________
conv2d_24 (Conv2D)           (None, 24, 24, 64)        102464    
_________________________________________________________________
max_pooling2d_12 (MaxPooling (None, 12, 12, 64)        0         
_________________________________________________________________
dropout_17 (Dropout)         (None, 12, 12, 64)        0         
_________________________________________________________________
flatten_6 (Flatten)          (None, 9216)              0         
_________________________________________________________________
dense_11 (Dense)             (None, 512)               4719104   
_________________________________________________________________
dropout_18 (Dropout)         (None, 512)               0         
_________________________________________________________________
dense_12 (Dense)             (None, 7)                 3591      
=================================================================
Total params: 5,031,751
Trainable params: 5,031,751
Non-trainable params: 0
_________________________________________________________________