_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_13 (Conv2D)           (None, 48, 48, 64)        1664      
_________________________________________________________________
conv2d_14 (Conv2D)           (None, 48, 48, 64)        102464    
_________________________________________________________________
max_pooling2d_7 (MaxPooling2 (None, 24, 24, 64)        0         
_________________________________________________________________
dropout_10 (Dropout)         (None, 24, 24, 64)        0         
_________________________________________________________________
conv2d_15 (Conv2D)           (None, 24, 24, 64)        102464    
_________________________________________________________________
conv2d_16 (Conv2D)           (None, 24, 24, 64)        102464    
_________________________________________________________________
max_pooling2d_8 (MaxPooling2 (None, 12, 12, 64)        0         
_________________________________________________________________
dropout_11 (Dropout)         (None, 12, 12, 64)        0         
_________________________________________________________________
flatten_4 (Flatten)          (None, 9216)              0         
_________________________________________________________________
dense_10 (Dense)             (None, 1024)              9438208   
_________________________________________________________________
dense_11 (Dense)             (None, 1024)              1049600   
_________________________________________________________________
dropout_12 (Dropout)         (None, 1024)              0         
_________________________________________________________________
dense_12 (Dense)             (None, 7)                 7175      
=================================================================
Total params: 10,804,039
Trainable params: 10,804,039
Non-trainable params: 0
_________________________________________________________________
