_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_37 (Conv2D)           (None, 48, 48, 64)        1664      
_________________________________________________________________
conv2d_38 (Conv2D)           (None, 48, 48, 64)        102464    
_________________________________________________________________
max_pooling2d_19 (MaxPooling (None, 24, 24, 64)        0         
_________________________________________________________________
dropout_28 (Dropout)         (None, 24, 24, 64)        0         
_________________________________________________________________
conv2d_39 (Conv2D)           (None, 24, 24, 64)        102464    
_________________________________________________________________
conv2d_40 (Conv2D)           (None, 24, 24, 64)        102464    
_________________________________________________________________
max_pooling2d_20 (MaxPooling (None, 12, 12, 64)        0         
_________________________________________________________________
dropout_29 (Dropout)         (None, 12, 12, 64)        0         
_________________________________________________________________
flatten_10 (Flatten)         (None, 9216)              0         
_________________________________________________________________
dense_28 (Dense)             (None, 256)               2359552   
_________________________________________________________________
dense_29 (Dense)             (None, 256)               65792     
_________________________________________________________________
dropout_30 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_30 (Dense)             (None, 7)                 1799      
=================================================================
Total params: 2,736,199
Trainable params: 2,736,199
Non-trainable params: 0
_________________________________________________________________