_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_25 (Conv2D)           (None, 48, 48, 64)        1664      
_________________________________________________________________
conv2d_26 (Conv2D)           (None, 48, 48, 64)        102464    
_________________________________________________________________
max_pooling2d_13 (MaxPooling (None, 24, 24, 64)        0         
_________________________________________________________________
dropout_19 (Dropout)         (None, 24, 24, 64)        0         
_________________________________________________________________
conv2d_27 (Conv2D)           (None, 24, 24, 64)        102464    
_________________________________________________________________
conv2d_28 (Conv2D)           (None, 24, 24, 64)        102464    
_________________________________________________________________
max_pooling2d_14 (MaxPooling (None, 12, 12, 64)        0         
_________________________________________________________________
dropout_20 (Dropout)         (None, 12, 12, 64)        0         
_________________________________________________________________
flatten_7 (Flatten)          (None, 9216)              0         
_________________________________________________________________
dense_19 (Dense)             (None, 1024)              9438208   
_________________________________________________________________
dense_20 (Dense)             (None, 1024)              1049600   
_________________________________________________________________
dropout_21 (Dropout)         (None, 1024)              0         
_________________________________________________________________
dense_21 (Dense)             (None, 7)                 7175      
=================================================================
Total params: 10,804,039
Trainable params: 10,804,039
Non-trainable params: 0
_________________________________________________________________