_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_17 (Conv2D)           (None, 48, 48, 64)        2624      8,5
_________________________________________________________________
conv2d_18 (Conv2D)           (None, 48, 48, 64)        163904    8,5
_________________________________________________________________
max_pooling2d_9 (MaxPooling2 (None, 24, 24, 64)        0         
_________________________________________________________________
dropout_13 (Dropout)         (None, 24, 24, 64)        0         
_________________________________________________________________
conv2d_19 (Conv2D)           (None, 24, 24, 64)        102464    
_________________________________________________________________
conv2d_20 (Conv2D)           (None, 24, 24, 64)        102464    
_________________________________________________________________
max_pooling2d_10 (MaxPooling (None, 12, 12, 64)        0         
_________________________________________________________________
dropout_14 (Dropout)         (None, 12, 12, 64)        0         
_________________________________________________________________
flatten_5 (Flatten)          (None, 9216)              0         
_________________________________________________________________
dense_9 (Dense)              (None, 128)               1179776   
_________________________________________________________________
dropout_15 (Dropout)         (None, 128)               0         
_________________________________________________________________
dense_10 (Dense)             (None, 7)                 903       
=================================================================
Total params: 1,552,135
Trainable params: 1,552,135
Non-trainable params: 0
_________________________________________________________________